update note
